app/controllers/events_controller.rb

  def create
    @event=Event.new(params[:event])
    @event.save
---
INSERT INTO "events" ("name", "created_at", "updated_at", "description", "is_public", "capacity") VALUES('asdasd', '2010-05-18 05:57:05', '2010-05-18 05:57:05', 'asdsadsadad', NULL, NULL)

  def update
      @event=Event.find(params[:id])

      @event.update_attributes(params[:event])
---
SELECT * FROM "events" WHERE ("events"."id" = 2)
UPDATE "events" SET "updated_at" = '2010-05-18 05:54:46', "description" = 'asdsadad' WHERE "id" = 2