app/controllers/forums_controller.rb

  def index
    @forums = Forum.paginate(:page => params[:page], :order => "created_at DESC")
---
SELECT * FROM "forums"

  def create
    @forum = Forum.new(params[:forum])
    if @forum.save
---
INSERT INTO "forums" ("name", "created_at", "updated_at", "description") VALUES('asd', '2010-05-18 08:42:05', '2010-05-18 08:42:05', 'asd')

  def update
    if @forum.update_attributes(params[:forum])
---
UPDATE "forums" SET "updated_at" = '2010-05-18 08:58:23', "name" = 'The forumq', "description" = 'asdasdasdq' WHERE "id" = 2

  def destroy
    if @forum.destroy
---
DELETE FROM "forums" WHERE "id" = 4

  def find_forum
    @forum = Forum.find(params[:id])
---
SELECT * FROM "forums" WHERE ("forums"."id" = 5)