app/controllers/posts_controller.rb

  def index
    @posts = @forum.posts.paginate :page => params[:page], :order => "created_at DESC"
---
SELECT * FROM "posts" WHERE ("posts".forum_id = 2)

  def show
    @post = @forum.posts.find(params[:id])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 2 AND ("posts".forum_id = 2))

  def create
    @post = @forum.posts.build(params[:post])
    @post.user =current_user
    @post.save
---
INSERT INTO "posts" ("created_at", "title", "updated_at", "poster", "forum_id", "content") VALUES('2010-05-18 08:49:54', 'test title', '2010-05-18 08:49:54', 'poster3', NULL, 'hello after restfull')

  def edit
     @post = current_user.posts.find(params[:id])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 6 AND ("posts".forum_id = 2))

  def update
    @post = current_user.posts.find(params[:id])
    @post.update_attributes(params[:post])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 6 AND ("posts".forum_id = 2))
UPDATE "posts" SET "updated_at" = '2010-05-18 08:56:17', "poster" = 'asdad', "title" = 'asdassad', "content" = 'dsadasdasdasdad' WHERE "id" = 6

  def destroy

    @poster = current_user.posts.find(params[:id])
    @post.destroy
---
SELECT * FROM "posts" WHERE ("posts"."id" = 6 AND ("posts".forum_id = 2))
DELETE FROM "posts" WHERE "id" = 6

  def find_forum
    @forum = Forum.find(params[:forum_id])
---
SELECT * FROM "forums" WHERE ("forums"."id" = 2)